## dev plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda.aws_lambda_function.output_event_message has been changed
  ~ resource "aws_lambda_function" "output_event_message" {
        id                             = "dev-edp-output-event-message"
      ~ source_code_hash               = "A1IUNwfZ+l1qQEFo/nTHxqQ15OUkjFgjGWtb12W8M10=" -> "lXr46t3kAPkTRmzI83S1YljQazu8VyUIP7pr54tmYkI="
        tags                           = {}
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.output_event_message will be updated in-place
  ~ resource "aws_lambda_function" "output_event_message" {
        id                             = "dev-edp-output-event-message"
      ~ last_modified                  = "2022-05-09T11:47:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "lXr46t3kAPkTRmzI83S1YljQazu8VyUIP7pr54tmYkI=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.archive_file.lambda_output_event_message will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_output_event_message"  {
      ~ id                  = "5c2ad39b8d2b9d5aa0f68d03874de811c3fca97f" -> (known after apply)
      ~ output_base64sha256 = "A1IUNwfZ+l1qQEFo/nTHxqQ15OUkjFgjGWtb12W8M10=" -> (known after apply)
      ~ output_md5          = "dcff4fc096b8dbd775ac0c3879e36aa2" -> (known after apply)
      ~ output_path         = "../../files/python_lambda_package/package.zip" -> (known after apply)
      ~ output_sha          = "5c2ad39b8d2b9d5aa0f68d03874de811c3fca97f" -> (known after apply)
      ~ output_size         = 141 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.data.null_data_source.packaging_changes will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "packaging_changes"  {
      ~ has_computed_default = "default" -> (known after apply)
      ~ id                   = "static" -> (known after apply)
      ~ inputs               = {
          ~ "null_id"      = "1929920670865345495" -> (known after apply)
            # (1 unchanged element hidden)
        }
      ~ outputs              = {
-           "null_id"      = "1929920670865345495"
-           "package_path" = "../../files/python_lambda_package/package.zip"
        } -> (known after apply)
      ~ random               = "2310508096160259924" -> (known after apply)
    }

  # module.lambda.module.lambda_python_dependencies.aws_s3_object.lambda_output_event_message will be updated in-place
  ~ resource "aws_s3_object" "lambda_output_event_message" {
      ~ etag               = "dcff4fc096b8dbd775ac0c3879e36aa2" -> (known after apply)
        id                 = "dev/lambda/generated/output_event_message.zip"
      ~ source             = "../../files/python_lambda_package/package.zip" -> (known after apply)
        tags               = {}
      ~ version_id         = "gw9W1MUygob0upUb.p_P6_R48XL8GHE9" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lambda.module.lambda_python_dependencies.null_resource.packaging must be replaced
-/+ resource "null_resource" "packaging" {
      ~ id       = "1929920670865345495" -> (known after apply)
-       triggers = {
-           "dir_sha1" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
        } -> null # forces replacement
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```